# Напиши программу:

# Пользователь вводит число если оно больше 0 → вывести "Положительное"
# иначе → "Отрицательное или ноль"

# number = int(input())

# if number > 0:
#     print("Положительное")

# else:
#     print("Отрицательное или ноль")

# age = 2
# has_ticket = False

# if not age >= 18 or has_ticket:
#     print("Можно смотреть фильм")
# else:
#     print("Доступ запрещён")


# is_banned = True

# if not is_banned:
#     print("Пользователь может войти")
# else:
#     print("Пользователь заблокирован")



# Напиши программу:

# Пользователь вводит возраст если возраст от 18 до 60 → можно работать
# иначе → нельзя

# age = int(input())

# if 18 <= age <= 60:
#     print("Можно работать")

# else:
#     print("Нельзя")



# age = int(input())

# if age <= 60 and age >= 18:
#     print("Можно работать")

# else:
#     print("Нельзя")



# age = 2
# has_passport = True

# if age >= 18:
#     print("Возраст подходит")

#     if has_passport:
#         print("Можно выезжать за границу")
#     else:
#         print("Нет паспорта")
# else:
#     print("Слишком молодой")



# Напишите программу:
# Пользователь вводит оценку - число в диапазоне от 0 жо 100
# Необходимо определить к какой категории относится оценка и вывести на экран
# 90+ → отлично
# 70+ → хорошо
# 50+ → нормально
# иначе → плохо

# mark = int(input())

# if mark >= 90:
#     print("Отлично")

# elif mark >= 70:
#     print("Хорошо")

# elif mark >= 50:
#     print("Нормально")

# else:
#     print("Плохо")